<?php
//000000000000
 exit();?>
a:1:{s:5:"basic";a:5:{s:3:"key";s:5:"basic";s:8:"describe";s:12:"基础设置";s:6:"values";a:3:{s:9:"is_dealer";s:1:"0";s:7:"is_open";s:1:"1";s:14:"merchant_rules";s:14033:"亲爱的用户，欢迎您使用“企维度”软件及服务！

尊敬的用户您好，企维度官网的登录接口已与”企维度”打通，请您在使用本软件之前，认真阅读、并充分理解“企维度”软件许可及服务协议（以下简称“本协议”）及各条款内容，尤其需关注免除或者限制责任的条款，并确认是否接受。未满18周岁的未成年人请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。用户的下载、安装、使用、帐号获取和登录等行为将视为已接受本协议所有条款及其约束。

“企维度”软件（以下简称“本软件”）是中国企维度财产保险股份有限公司（以下简称“企维度”）为用户提供的车主服务工具，提供包括但不限于买保险、查违章、省油钱、洗车、修车、保养、车联网等车主服务功能。我们将致力于为广大车主提供全方位的移动用车服务。

一、软件许可范围

1 本软件提供包括但不限于ios、android等多个应用版本，用户必须选择与所安装终端相匹配的软件版本。

2 企维度授予用户一项个人的、永久性、不可转让和非排他的使用许可，以使用本软件。用户可以为非商业目的在单一台终端设备上安装并使用本软件。

3 本条及本协议其他条款未明示授权的其他一切权利仍归企维度所有。除非有书面明示，企维度不放弃相关权益。

4 若用户对本软件有任何意见或改进的建议，均可向企维度提出。

二、知识产权声明

1 本软件的一切著作权、专利权、商标权、商业秘密等知识产权，以及与本软件相关的所有信息内容，包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等，均受中华人民共和国法律法规和相应的国际条约保护，除涉及第三方授权的软件或技术外，企维度享有上述知识产权。

2 未经企维度书面同意，用户不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权，企维度保留追究上述未经许可行为的权利。

3 本软件上可由多人参与编辑的内容，包括但不限于问题及补充说明、答案总结、话题描述、话题结构，所有参与编辑者均同意，相关知识产权归企维度所有。

4 为了促进知识的分享和传播，用户将其在本软件上发表的全部内容，授予企维度免费的、不可撤销的、非独家使用许可，企维度有权将该内容用于企维度各种形态的产品和服务上，包括但不限于网站以及发表的应用或其他互联网产品。

5 在本软件上传或发表的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，企维度有权根据实际情况删除相关的内容，且有权追究用户的法律责任。给企维度或任何第三方造成损失的，用户应负责全额赔偿。

6 企维度有权但无义务对用户发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规对侵权信息进行处理。

三、软件的安装、升级及终止

1 您可以直接从企维度官网上获取并安装本软件，也可以从企维度授权的第三方应用中下载。如果您从非以上的第三方获取本软件或与本软件名称相同的安装程序，企维度无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。

2 请下载并安装适合您终端的软件版本，并请按照软件提示步骤正确安装。为提供更加优质、安全的服务，在本软件安装时企维度可能推荐您安装其他软件，您可以选择安装或不安装。

3 如您不再需要使用本软件，有权利自行卸载本软件。

4 为了保证本软件及服务的安全性和功能的一致性，企维度有权不经向您特别通知，而对本软件做不定期更新，或者对软件的部分功能效果进行改变或限制。为保证您的使用体验，请您及时下载最新版本并升级，企维度不保证旧版本软件继续可用及对应的客户服务。

5 企维度拥有未经事先通知用户而修改软件功能、中断或中止软件使用的权利

四、用户使用须知

1 用户信息安全

1) 企维度非常重视用户的隐私权，将会尽最大努力保护用户的个人信息。除法律法规规定的情形外，未经用户许可企维度不会向第三方公开、透露用户个人信息。

2) 企维度拥有完善的信息管理安全制度，为保障用户个人信息的安全，对重要用户信息采用了专业的加密存储与传输方式，以免用户信息遭受未经授权的访问、使用或披露。

3) 用户在使用本软件的过程中，需要提供一些必要的个人信息，如手机号码、车辆信息、地理位置等，因产品服务与实际使用功能相关联，若您提供的信息不完整、不真实，则可能在使用过程中受限或无法使用部分功能。

4) 用户使用本软件，即视为理解并同意以下条款：

用户本人授权企维度集团，除法律另有规定之外，将本人提供给企维度集团的信息、享受企维度集团服务产生的信息（包括本单证签署之前提供和产生的信息）以及企维度集团根据本条约定查询、收集的信息，用于企维度集团及其因服务必要委托的合作伙伴为本人提供服务、推荐产品、开展市场调查与信息数据分析。

用户本人授权企维度集团，除法律另有规定之外，基于为本人提供更优质服务和产品的目的，向企维度集团因服务必要开展合作的伙伴查询、收集、提供本人的信息。

为确保本人信息的安全，企维度集团及其合作伙伴对上述信息负有保密义务，并采取各种措施保证信息安全。

如您不同意上述授权条款的部分或全部，可致电客服热线（95511）取消或变更授权。

本条所称“企维度集团”是指中国企维度保险（集团）股份有限公司及其直接或间接控股的公司，以及中国企维度保险（集团）股份有限公司直接或间接作为其单一最大股东的公司。

2 帐号使用须知

1) 企维度帐号的所有权归企维度公司所有，用户完成申请注册手续后，仅获得企维度帐号的使用权，且该使用权仅属于首次申请注册人，同时，首次申请注册人不得赠与、借用、租用、转让或售卖企维度帐号或者以其他方式许可非首次申请注册人使用企维度帐号。非首次申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用企维度账号。

2) 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。在您怀疑他人在使用您的帐号时，您应立即通知企维度公司处理。

3) 用户长期不登录其注册的企维度帐号，企维度有权回收该帐号，并清理相关存储数据，以免造成资源浪费，由此带来的任何损失均由用户自行承担。

4) 用户需为自己注册帐号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。企维度无法且不会对因前述风险而导致的任何损失或损害承担责任。

5) 用户在成功注册后，默认同意壹钱包注册协议条款。

3 其他注意事项

1)本软件使用过程中会产生数据流量的费用，用户需自行向运营商了解相关资费，并自行承担相关费用。

2) 您在使用本软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议。

3) 企维度将会尽力保障您在本软件及服务中的数据存储安全，但是，企维度并不能完全保证所有用户数据完整、可能出现存储失败、或服务终止数据被删除等情况，企维度没有义务向用户提供或返还任何数据。

五、行为规范及法律责任

1 用户不得利用本软件及服务制作、复制、发布、传播如下侵犯其他用户或第三方合法权益、干扰本软件正常运营的内容，不得利用本软件及服务从事任何违法犯罪活动。包括但不限于：

1) 发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽或含有任何性或性暗示的、暴力的内容；

2) 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；

3) 侵犯他人隐私、个人信息或资料；

4) 发表、传送、传播骚扰、广告信息及垃圾信息；

5) 提交、发布虚假信息，或冒充、利用他人名义；

6) 虚构事实、隐瞒真相以误导、欺骗他人；

7) 其他违反法律法规、政策及公序良俗、社会公德或干扰天下通正常运营和侵犯其他用户或第三方合法权益内容的信息。

2 用户在使用本软件及服务时，须自行承担如下来自企维度不可掌控的风险内容，包括但不限于：

1) 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；

2) 用户必须选择与所安装手机相匹配的软件版本，否则，由于软件与手机型号不相匹配所导致的任何问题或损害，均由用户自行承担；

3) 用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；

4) 用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；

5) 由于网络信号不稳定、带宽资源不足等原因，所引起的软件登录失败、资料同步不完整、页面打开速度慢等风险；

6) 用户应加强信息安全及个人信息的保护意识、不应轻信借款、索要密码或其他涉及财产的网络信息，注意密码保护，以免遭受损失，因此产生的损失由用户自行承担。

3 用户在遵守法律及本协议的前提下使用本软件，用户在使用过程中不得从事下列行为，包括但不限于：

1) 删除本软件及其副本上关于著作权的信息；

2) 不得制作、发布、使用、传播用于窃取天下通帐号及他人个人信息、财产的恶意程序；

3) 对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；

4) 对企维度拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；

5) 对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非企维度经授权的第三方工具/服务接入本软件和相关系统；

6) 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；

7) 通过过非企维度开发、授权的第三方软件、插件、外挂、系统，登录或使用企维度软件及服务，或制作、发布、传播上述工具；

8) 自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰。

4 法律责任及违约处理

1) 如果用户违反本协议约定，或者收到用户举报或投诉，企维度有权不经通知随时对相关内容进行删除，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用全部或部分功能、帐号封禁直至注销的处罚。

2) 企维度有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。

3) 因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；企维度因此遭受损失的，您也应当一并赔偿。

4) 如因本软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，企维度不承担任何责任。企维度不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。

5) 企维度对不可抗力导致的损失不承担责任。本服务条款所指不可抗力包括：天灾、法律法规或政府指令的变更等。

六、其他注意事项

1 企维度有权不定期更新本协议条款，您可以在本软件的最新版本中查阅此协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。

2 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。

3 如本协议中的任何条款因任何原因被判定为完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有执行力。

合肥企维度网络科技有限公司";}s:8:"wxapp_id";i:10001;s:11:"update_time";s:19:"2020-07-09 17:31:42";}}