<?php

namespace app\api\model;

use think\Cache;

/**
 * 多商戶城市管理
 * Class Cart
 * @package app\api\model
 */
class Ccity
{
    
    public static $city = ["2"=>["id"=>2,"name"=>"北京市",],"20"=>["id"=>20,"name"=>"天津市",],"38"=>["id"=>38,"name"=>"石家庄市",],"61"=>["id"=>61,"name"=>"唐山市",],"76"=>["id"=>76,"name"=>"秦皇岛市",],"84"=>["id"=>84,"name"=>"邯郸市",],"104"=>["id"=>104,"name"=>"邢台市",],"124"=>["id"=>124,"name"=>"保定市",],"150"=>["id"=>150,"name"=>"张家口市",],"168"=>["id"=>168,"name"=>"承德市",],"180"=>["id"=>180,"name"=>"沧州市",],"197"=>["id"=>197,"name"=>"廊坊市",],"208"=>["id"=>208,"name"=>"衡水市",],"221"=>["id"=>221,"name"=>"太原市",],"232"=>["id"=>232,"name"=>"大同市",],"244"=>["id"=>244,"name"=>"阳泉市",],"250"=>["id"=>250,"name"=>"长治市",],"264"=>["id"=>264,"name"=>"晋城市",],"271"=>["id"=>271,"name"=>"朔州市",],"278"=>["id"=>278,"name"=>"晋中市",],"290"=>["id"=>290,"name"=>"运城市",],"304"=>["id"=>304,"name"=>"忻州市",],"319"=>["id"=>319,"name"=>"临汾市",],"337"=>["id"=>337,"name"=>"吕梁市",],"352"=>["id"=>352,"name"=>"呼和浩特市",],"362"=>["id"=>362,"name"=>"包头市",],"372"=>["id"=>372,"name"=>"乌海市",],"376"=>["id"=>376,"name"=>"赤峰市",],"389"=>["id"=>389,"name"=>"通辽市",],"398"=>["id"=>398,"name"=>"鄂尔多斯市",],"407"=>["id"=>407,"name"=>"呼伦贝尔市",],"422"=>["id"=>422,"name"=>"巴彦淖尔市",],"430"=>["id"=>430,"name"=>"乌兰察布市",],"442"=>["id"=>442,"name"=>"兴安盟",],"449"=>["id"=>449,"name"=>"锡林郭勒盟",],"462"=>["id"=>462,"name"=>"阿拉善盟",],"467"=>["id"=>467,"name"=>"沈阳市",],"481"=>["id"=>481,"name"=>"大连市",],"492"=>["id"=>492,"name"=>"鞍山市",],"500"=>["id"=>500,"name"=>"抚顺市",],"508"=>["id"=>508,"name"=>"本溪市",],"515"=>["id"=>515,"name"=>"丹东市",],"522"=>["id"=>522,"name"=>"锦州市",],"530"=>["id"=>530,"name"=>"营口市",],"537"=>["id"=>537,"name"=>"阜新市",],"545"=>["id"=>545,"name"=>"辽阳市",],"553"=>["id"=>553,"name"=>"盘锦市",],"558"=>["id"=>558,"name"=>"铁岭市",],"566"=>["id"=>566,"name"=>"朝阳市",],"574"=>["id"=>574,"name"=>"葫芦岛市",],"581"=>["id"=>581,"name"=>"金普新区",],"586"=>["id"=>586,"name"=>"长春市",],"597"=>["id"=>597,"name"=>"吉林市",],"607"=>["id"=>607,"name"=>"四平市",],"614"=>["id"=>614,"name"=>"辽源市",],"619"=>["id"=>619,"name"=>"通化市",],"627"=>["id"=>627,"name"=>"白山市",],"634"=>["id"=>634,"name"=>"松原市",],"640"=>["id"=>640,"name"=>"白城市",],"646"=>["id"=>646,"name"=>"延边朝鲜族自治州",],"656"=>["id"=>656,"name"=>"哈尔滨市",],"675"=>["id"=>675,"name"=>"齐齐哈尔市",],"692"=>["id"=>692,"name"=>"鸡西市",],"702"=>["id"=>702,"name"=>"鹤岗市",],"711"=>["id"=>711,"name"=>"双鸭山市",],"720"=>["id"=>720,"name"=>"大庆市",],"730"=>["id"=>730,"name"=>"伊春市",],"748"=>["id"=>748,"name"=>"佳木斯市",],"759"=>["id"=>759,"name"=>"七台河市",],"764"=>["id"=>764,"name"=>"牡丹江市",],"775"=>["id"=>775,"name"=>"黑河市",],"782"=>["id"=>782,"name"=>"绥化市",],"793"=>["id"=>793,"name"=>"大兴安岭地区",],"802"=>["id"=>802,"name"=>"上海市",],"821"=>["id"=>821,"name"=>"南京市",],"833"=>["id"=>833,"name"=>"无锡市",],"842"=>["id"=>842,"name"=>"徐州市",],"853"=>["id"=>853,"name"=>"常州市",],"861"=>["id"=>861,"name"=>"苏州市",],"871"=>["id"=>871,"name"=>"南通市",],"880"=>["id"=>880,"name"=>"连云港市",],"887"=>["id"=>887,"name"=>"淮安市",],"896"=>["id"=>896,"name"=>"盐城市",],"906"=>["id"=>906,"name"=>"扬州市",],"913"=>["id"=>913,"name"=>"镇江市",],"920"=>["id"=>920,"name"=>"泰州市",],"927"=>["id"=>927,"name"=>"宿迁市",],"934"=>["id"=>934,"name"=>"杭州市",],"948"=>["id"=>948,"name"=>"宁波市",],"960"=>["id"=>960,"name"=>"温州市",],"972"=>["id"=>972,"name"=>"嘉兴市",],"980"=>["id"=>980,"name"=>"湖州市",],"986"=>["id"=>986,"name"=>"绍兴市",],"993"=>["id"=>993,"name"=>"金华市",],"1003"=>["id"=>1003,"name"=>"衢州市",],"1010"=>["id"=>1010,"name"=>"舟山市",],"1015"=>["id"=>1015,"name"=>"台州市",],"1025"=>["id"=>1025,"name"=>"丽水市",],"1035"=>["id"=>1035,"name"=>"舟山群岛新区",],"1047"=>["id"=>1047,"name"=>"合肥市",],"1057"=>["id"=>1057,"name"=>"芜湖市",],"1066"=>["id"=>1066,"name"=>"蚌埠市",],"1074"=>["id"=>1074,"name"=>"淮南市",],"1081"=>["id"=>1081,"name"=>"马鞍山市",],"1088"=>["id"=>1088,"name"=>"淮北市",],"1093"=>["id"=>1093,"name"=>"铜陵市",],"1098"=>["id"=>1098,"name"=>"安庆市",],"1110"=>["id"=>1110,"name"=>"黄山市",],"1118"=>["id"=>1118,"name"=>"滁州市",],"1127"=>["id"=>1127,"name"=>"阜阳市",],"1136"=>["id"=>1136,"name"=>"宿州市",],"1142"=>["id"=>1142,"name"=>"六安市",],"1150"=>["id"=>1150,"name"=>"亳州市",],"1155"=>["id"=>1155,"name"=>"池州市",],"1160"=>["id"=>1160,"name"=>"宣城市",],"1169"=>["id"=>1169,"name"=>"福州市",],"1183"=>["id"=>1183,"name"=>"厦门市",],"1190"=>["id"=>1190,"name"=>"莆田市",],"1196"=>["id"=>1196,"name"=>"三明市",],"1209"=>["id"=>1209,"name"=>"泉州市",],"1222"=>["id"=>1222,"name"=>"漳州市",],"1234"=>["id"=>1234,"name"=>"南平市",],"1245"=>["id"=>1245,"name"=>"龙岩市",],"1253"=>["id"=>1253,"name"=>"宁德市",],"1264"=>["id"=>1264,"name"=>"南昌市",],"1274"=>["id"=>1274,"name"=>"景德镇市",],"1279"=>["id"=>1279,"name"=>"萍乡市",],"1285"=>["id"=>1285,"name"=>"九江市",],"1299"=>["id"=>1299,"name"=>"新余市",],"1302"=>["id"=>1302,"name"=>"鹰潭市",],"1306"=>["id"=>1306,"name"=>"赣州市",],"1325"=>["id"=>1325,"name"=>"吉安市",],"1339"=>["id"=>1339,"name"=>"宜春市",],"1350"=>["id"=>1350,"name"=>"抚州市",],"1362"=>["id"=>1362,"name"=>"上饶市",],"1376"=>["id"=>1376,"name"=>"济南市",],"1387"=>["id"=>1387,"name"=>"青岛市",],"1399"=>["id"=>1399,"name"=>"淄博市",],"1408"=>["id"=>1408,"name"=>"枣庄市",],"1415"=>["id"=>1415,"name"=>"东营市",],"1421"=>["id"=>1421,"name"=>"烟台市",],"1434"=>["id"=>1434,"name"=>"潍坊市",],"1447"=>["id"=>1447,"name"=>"济宁市",],"1459"=>["id"=>1459,"name"=>"泰安市",],"1466"=>["id"=>1466,"name"=>"威海市",],"1471"=>["id"=>1471,"name"=>"日照市",],"1476"=>["id"=>1476,"name"=>"莱芜市",],"1479"=>["id"=>1479,"name"=>"临沂市",],"1492"=>["id"=>1492,"name"=>"德州市",],"1504"=>["id"=>1504,"name"=>"聊城市",],"1513"=>["id"=>1513,"name"=>"滨州市",],"1522"=>["id"=>1522,"name"=>"菏泽市",],"1533"=>["id"=>1533,"name"=>"郑州市",],"1546"=>["id"=>1546,"name"=>"开封市",],"1556"=>["id"=>1556,"name"=>"洛阳市",],"1572"=>["id"=>1572,"name"=>"平顶山市",],"1583"=>["id"=>1583,"name"=>"安阳市",],"1593"=>["id"=>1593,"name"=>"鹤壁市",],"1599"=>["id"=>1599,"name"=>"新乡市",],"1612"=>["id"=>1612,"name"=>"焦作市",],"1623"=>["id"=>1623,"name"=>"濮阳市",],"1630"=>["id"=>1630,"name"=>"许昌市",],"1637"=>["id"=>1637,"name"=>"漯河市",],"1643"=>["id"=>1643,"name"=>"三门峡市",],"1650"=>["id"=>1650,"name"=>"南阳市",],"1664"=>["id"=>1664,"name"=>"商丘市",],"1674"=>["id"=>1674,"name"=>"信阳市",],"1685"=>["id"=>1685,"name"=>"周口市",],"1696"=>["id"=>1696,"name"=>"驻马店市",],"1707"=>["id"=>1707,"name"=>"直辖县级",],"1710"=>["id"=>1710,"name"=>"武汉市",],"1724"=>["id"=>1724,"name"=>"黄石市",],"1731"=>["id"=>1731,"name"=>"十堰市",],"1740"=>["id"=>1740,"name"=>"宜昌市",],"1754"=>["id"=>1754,"name"=>"襄阳市",],"1764"=>["id"=>1764,"name"=>"鄂州市",],"1768"=>["id"=>1768,"name"=>"荆门市",],"1774"=>["id"=>1774,"name"=>"孝感市",],"1782"=>["id"=>1782,"name"=>"荆州市",],"1791"=>["id"=>1791,"name"=>"黄冈市",],"1802"=>["id"=>1802,"name"=>"咸宁市",],"1809"=>["id"=>1809,"name"=>"随州市",],"1813"=>["id"=>1813,"name"=>"恩施土家族苗族自治州",],"1822"=>["id"=>1822,"name"=>"省直辖县级行政区划",],"1828"=>["id"=>1828,"name"=>"长沙市",],"1838"=>["id"=>1838,"name"=>"株洲市",],"1848"=>["id"=>1848,"name"=>"湘潭市",],"1854"=>["id"=>1854,"name"=>"衡阳市",],"1867"=>["id"=>1867,"name"=>"邵阳市",],"1880"=>["id"=>1880,"name"=>"岳阳市",],"1890"=>["id"=>1890,"name"=>"常德市",],"1900"=>["id"=>1900,"name"=>"张家界市",],"1905"=>["id"=>1905,"name"=>"益阳市",],"1912"=>["id"=>1912,"name"=>"郴州市",],"1924"=>["id"=>1924,"name"=>"永州市",],"1936"=>["id"=>1936,"name"=>"怀化市",],"1949"=>["id"=>1949,"name"=>"娄底市",],"1955"=>["id"=>1955,"name"=>"湘西土家族苗族自治州",],"1965"=>["id"=>1965,"name"=>"广州市",],"1977"=>["id"=>1977,"name"=>"韶关市",],"1988"=>["id"=>1988,"name"=>"深圳市",],"1999"=>["id"=>1999,"name"=>"珠海市",],"2003"=>["id"=>2003,"name"=>"汕头市",],"2011"=>["id"=>2011,"name"=>"佛山市",],"2017"=>["id"=>2017,"name"=>"江门市",],"2025"=>["id"=>2025,"name"=>"湛江市",],"2035"=>["id"=>2035,"name"=>"茂名市",],"2041"=>["id"=>2041,"name"=>"肇庆市",],"2050"=>["id"=>2050,"name"=>"惠州市",],"2056"=>["id"=>2056,"name"=>"梅州市",],"2065"=>["id"=>2065,"name"=>"汕尾市",],"2070"=>["id"=>2070,"name"=>"河源市",],"2077"=>["id"=>2077,"name"=>"阳江市",],"2082"=>["id"=>2082,"name"=>"清远市",],"2091"=>["id"=>2091,"name"=>"东莞市",],"2123"=>["id"=>2123,"name"=>"中山市",],"2146"=>["id"=>2146,"name"=>"潮州市",],"2150"=>["id"=>2150,"name"=>"揭阳市",],"2156"=>["id"=>2156,"name"=>"云浮市",],"2163"=>["id"=>2163,"name"=>"南宁市",],"2177"=>["id"=>2177,"name"=>"柳州市",],"2189"=>["id"=>2189,"name"=>"桂林市",],"2207"=>["id"=>2207,"name"=>"梧州市",],"2215"=>["id"=>2215,"name"=>"北海市",],"2220"=>["id"=>2220,"name"=>"防城港市",],"2225"=>["id"=>2225,"name"=>"钦州市",],"2230"=>["id"=>2230,"name"=>"贵港市",],"2236"=>["id"=>2236,"name"=>"玉林市",],"2245"=>["id"=>2245,"name"=>"百色市",],"2258"=>["id"=>2258,"name"=>"贺州市",],"2264"=>["id"=>2264,"name"=>"河池市",],"2276"=>["id"=>2276,"name"=>"来宾市",],"2283"=>["id"=>2283,"name"=>"崇左市",],"2292"=>["id"=>2292,"name"=>"海口市",],"2297"=>["id"=>2297,"name"=>"三亚市",],"2302"=>["id"=>2302,"name"=>"三沙市",],"2306"=>["id"=>2306,"name"=>"直辖县级",],"2324"=>["id"=>2324,"name"=>"重庆市",],"2363"=>["id"=>2363,"name"=>"县",],"2368"=>["id"=>2368,"name"=>"成都市",],"2388"=>["id"=>2388,"name"=>"自贡市",],"2395"=>["id"=>2395,"name"=>"攀枝花市",],"2401"=>["id"=>2401,"name"=>"泸州市",],"2409"=>["id"=>2409,"name"=>"德阳市",],"2416"=>["id"=>2416,"name"=>"绵阳市",],"2426"=>["id"=>2426,"name"=>"广元市",],"2434"=>["id"=>2434,"name"=>"遂宁市",],"2440"=>["id"=>2440,"name"=>"内江市",],"2446"=>["id"=>2446,"name"=>"乐山市",],"2458"=>["id"=>2458,"name"=>"南充市",],"2468"=>["id"=>2468,"name"=>"眉山市",],"2475"=>["id"=>2475,"name"=>"宜宾市",],"2486"=>["id"=>2486,"name"=>"广安市",],"2493"=>["id"=>2493,"name"=>"达州市",],"2501"=>["id"=>2501,"name"=>"雅安市",],"2510"=>["id"=>2510,"name"=>"巴中市",],"2516"=>["id"=>2516,"name"=>"资阳市",],"2521"=>["id"=>2521,"name"=>"阿坝藏族羌族自治州",],"2535"=>["id"=>2535,"name"=>"甘孜藏族自治州",],"2554"=>["id"=>2554,"name"=>"凉山彝族自治州",],"2573"=>["id"=>2573,"name"=>"贵阳市",],"2584"=>["id"=>2584,"name"=>"六盘水市",],"2589"=>["id"=>2589,"name"=>"遵义市",],"2604"=>["id"=>2604,"name"=>"安顺市",],"2611"=>["id"=>2611,"name"=>"毕节市",],"2620"=>["id"=>2620,"name"=>"铜仁市",],"2631"=>["id"=>2631,"name"=>"黔西南布依族苗族自治州",],"2640"=>["id"=>2640,"name"=>"黔东南苗族侗族自治州",],"2657"=>["id"=>2657,"name"=>"黔南布依族苗族自治州",],"2671"=>["id"=>2671,"name"=>"昆明市",],"2686"=>["id"=>2686,"name"=>"曲靖市",],"2696"=>["id"=>2696,"name"=>"玉溪市",],"2706"=>["id"=>2706,"name"=>"保山市",],"2712"=>["id"=>2712,"name"=>"昭通市",],"2724"=>["id"=>2724,"name"=>"丽江市",],"2730"=>["id"=>2730,"name"=>"普洱市",],"2741"=>["id"=>2741,"name"=>"临沧市",],"2750"=>["id"=>2750,"name"=>"楚雄彝族自治州",],"2761"=>["id"=>2761,"name"=>"红河哈尼族彝族自治州",],"2775"=>["id"=>2775,"name"=>"文山壮族苗族自治州",],"2784"=>["id"=>2784,"name"=>"西双版纳傣族自治州",],"2788"=>["id"=>2788,"name"=>"大理白族自治州",],"2801"=>["id"=>2801,"name"=>"德宏傣族景颇族自治州",],"2807"=>["id"=>2807,"name"=>"怒江傈僳族自治州",],"2812"=>["id"=>2812,"name"=>"迪庆藏族自治州",],"2817"=>["id"=>2817,"name"=>"拉萨市",],"2826"=>["id"=>2826,"name"=>"日喀则市",],"2845"=>["id"=>2845,"name"=>"昌都市",],"2857"=>["id"=>2857,"name"=>"山南地区",],"2870"=>["id"=>2870,"name"=>"那曲地区",],"2882"=>["id"=>2882,"name"=>"阿里地区",],"2890"=>["id"=>2890,"name"=>"林芝地区",],"2899"=>["id"=>2899,"name"=>"西安市",],"2913"=>["id"=>2913,"name"=>"铜川市",],"2918"=>["id"=>2918,"name"=>"宝鸡市",],"2931"=>["id"=>2931,"name"=>"咸阳市",],"2946"=>["id"=>2946,"name"=>"渭南市",],"2958"=>["id"=>2958,"name"=>"延安市",],"2972"=>["id"=>2972,"name"=>"汉中市",],"2984"=>["id"=>2984,"name"=>"榆林市",],"2997"=>["id"=>2997,"name"=>"安康市",],"3008"=>["id"=>3008,"name"=>"商洛市",],"3016"=>["id"=>3016,"name"=>"西咸新区",],"3023"=>["id"=>3023,"name"=>"兰州市",],"3032"=>["id"=>3032,"name"=>"嘉峪关市",],"3036"=>["id"=>3036,"name"=>"金昌市",],"3039"=>["id"=>3039,"name"=>"白银市",],"3045"=>["id"=>3045,"name"=>"天水市",],"3053"=>["id"=>3053,"name"=>"武威市",],"3058"=>["id"=>3058,"name"=>"张掖市",],"3065"=>["id"=>3065,"name"=>"平凉市",],"3073"=>["id"=>3073,"name"=>"酒泉市",],"3081"=>["id"=>3081,"name"=>"庆阳市",],"3090"=>["id"=>3090,"name"=>"定西市",],"3098"=>["id"=>3098,"name"=>"陇南市",],"3108"=>["id"=>3108,"name"=>"临夏回族自治州",],"3117"=>["id"=>3117,"name"=>"甘南藏族自治州",],"3127"=>["id"=>3127,"name"=>"西宁市",],"3135"=>["id"=>3135,"name"=>"海东市",],"3142"=>["id"=>3142,"name"=>"海北藏族自治州",],"3147"=>["id"=>3147,"name"=>"黄南藏族自治州",],"3152"=>["id"=>3152,"name"=>"海南藏族自治州",],"3158"=>["id"=>3158,"name"=>"果洛藏族自治州",],"3165"=>["id"=>3165,"name"=>"玉树藏族自治州",],"3172"=>["id"=>3172,"name"=>"海西蒙古族藏族自治州",],"3179"=>["id"=>3179,"name"=>"银川市",],"3186"=>["id"=>3186,"name"=>"石嘴山市",],"3190"=>["id"=>3190,"name"=>"吴忠市",],"3196"=>["id"=>3196,"name"=>"固原市",],"3202"=>["id"=>3202,"name"=>"中卫市",],"3207"=>["id"=>3207,"name"=>"乌鲁木齐市",],"3216"=>["id"=>3216,"name"=>"克拉玛依市",],"3221"=>["id"=>3221,"name"=>"吐鲁番地区",],"3225"=>["id"=>3225,"name"=>"哈密地区",],"3229"=>["id"=>3229,"name"=>"昌吉回族自治州",],"3237"=>["id"=>3237,"name"=>"博尔塔拉蒙古自治州",],"3242"=>["id"=>3242,"name"=>"巴音郭楞蒙古自治州",],"3252"=>["id"=>3252,"name"=>"阿克苏地区",],"3262"=>["id"=>3262,"name"=>"克孜勒苏柯尔克孜自治州",],"3267"=>["id"=>3267,"name"=>"喀什地区",],"3280"=>["id"=>3280,"name"=>"和田地区",],"3289"=>["id"=>3289,"name"=>"伊犁哈萨克自治州",],"3301"=>["id"=>3301,"name"=>"塔城地区",],"3309"=>["id"=>3309,"name"=>"阿勒泰地区",],"3317"=>["id"=>3317,"name"=>"直辖县级",],"3326"=>["id"=>3326,"name"=>"台北市",],"3339"=>["id"=>3339,"name"=>"高雄市",],"3378"=>["id"=>3378,"name"=>"基隆市",],"3386"=>["id"=>3386,"name"=>"台中市",],"3416"=>["id"=>3416,"name"=>"台南市",],"3454"=>["id"=>3454,"name"=>"新竹市",],"3458"=>["id"=>3458,"name"=>"嘉义市",],"3461"=>["id"=>3461,"name"=>"新北市",],"3491"=>["id"=>3491,"name"=>"宜兰县",],"3504"=>["id"=>3504,"name"=>"桃园县",],"3518"=>["id"=>3518,"name"=>"新竹县",],"3532"=>["id"=>3532,"name"=>"苗栗县",],"3551"=>["id"=>3551,"name"=>"彰化县",],"3578"=>["id"=>3578,"name"=>"南投县",],"3592"=>["id"=>3592,"name"=>"云林县",],"3613"=>["id"=>3613,"name"=>"嘉义县",],"3632"=>["id"=>3632,"name"=>"屏东县",],"3666"=>["id"=>3666,"name"=>"台东县",],"3683"=>["id"=>3683,"name"=>"花莲县",],"3697"=>["id"=>3697,"name"=>"澎湖县",],"3704"=>["id"=>3704,"name"=>"金门县",],"3711"=>["id"=>3711,"name"=>"连江县",],"3999"=>["id"=>3999,"name"=>"香港特别行政区",],"3739"=>["id"=>3739,"name"=>"澳门半岛",],"3745"=>["id"=>3745,"name"=>"氹仔岛",],"3747"=>["id"=>3747,"name"=>"路环岛",]];

    /**
     * 根据城市获取城市id
     * @param int $post 商品id
     */
    public function cinfo($post)
    {
        $name = $post['city'];//post城市
        $data = self::$city;
        $cinfo = $this->getCityInfo($data,$name);
        return $cinfo;
    }
    /**
     * 获取二维数组中指定的数组
     * @param int $data  数组
     * @param int $name  需要比对的参数
     * @param int $param 数组键名
     */
    private function getCityInfo($data,$name,$param = 'name')
    {
        foreach ($data as $k1 => $v1) 
        {
            if($data[$k1][$param] == $name)
            {
                return $data[$k1];
                continue; 
            }
        }
    }
    /**
     * 获取多商户列表中所有的城市
     * @param int $cityId   城市id
     * @param int $cityName 城市名称
     */
    public function getCityList($post)
    {
        $cityId = $post['cityId'];//城市id
        $cityName = $post['cityName'];//城市名称
        $list =  \think\Db::name("merchant_active")->where(['status'=>1])
                    ->where(['is_delete'=>0])->field("city_id")->group("city_id")->select();
        $result = $this->tradeCityAllName($cityId,$cityName,$list);
        return $result;
    }
    /**
     * 根据城市id获取城市名称,并给赋于选中默认
     * @param int $id   城市id(默认)
     * @param int $name 城市名称(默认)
     * @param int $data 数组
     */
    private function tradeCityAllName($id,$name,$list)
    {
        $result = [];
        $data = self::$city;
        foreach ($list as $k1 => $v1) 
        {
            $info = $this->getCityInfo($data,$list[$k1]['city_id'],$param = 'id');
            if(!empty($info))
            {
                $result[] = ['id'=>$info['id'],
                         'name'=>$info['name'],
                         'on'=>$info['id'] == $id?1:0,
                        ];
            }
        }
        return $result;
    }

}
